Junior Year/January 2019/Assignment 5/Task 12/TUT11/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1000
(
(1.09571 0.000708386 0)
(1.09488 0.000124671 3.21015e-027)
(1.09455 0.000201402 0)
(1.09408 0.000269821 0)
(1.09349 0.000328466 0)
(1.09279 0.000377068 0)
(1.092 0.000416233 0)
(1.09114 0.000447076 2.13102e-027)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (2 0 0);
    }
    outlet
    {
        type            outletInlet;
        outletValue     uniform (1 0 0);
        value           uniform (1 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
