Junior Year/January 2019/Assignment 5/Task 12/TUT11/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1890
(
0.00010961
3.2106e-008
0.000109695
-8.45538e-008
0.000109764
-6.9175e-008
0.000109819
-5.54443e-008
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(-0.000109642 -0.000109659 -0.000109693 -0.000109747 -0.000109824 -0.000109928 -0.000110066 -0.00011025 -0.000110479 -0.000110672);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011 0.00011);
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
